package com.xj.stat.service;

import java.util.List;
import java.util.Map;

import com.xj.bean.Page;
import com.xj.stat.po.CrazySalesCommunityStatistics;
import com.xj.stat.po.CrazySalesShopStatistics;
import com.xj.stat.po.CrazySalesStatistics;

/**
 * 抢购统计数据访问服务
 * @author wangld
 */
public interface CrazySalesStatisticsService {

	/**
	 * 总览
	 * @return
	 * 返回的结果为：
	 * 
	 * 日期----下载量----注册量----发布活动量----出价总额
	 * date---download--register-----pub--------money
	 * 今日------151-----151---------12---------1830
	 * 昨日------151-----151---------18---------1200
	 * 本周------60------60----------60---------6000
	 * 上周------151-----151---------100--------8000
	 * 本月------151-----151---------80---------20000
	 * 上月------60------60----------60---------30000
	 */
	List<Map<String, Object>> summary();

	/**
	 * 
	 * 按日的统计
	 * @param begin 开始日期
	 * @param end 结束日期
	 * @return
	 * ----日期--------下载量--------注册量--------发布活动量--------出价总额
	 * ----date-------download------register--------pub------------money
	 * --2015-08-15------151--------151-------------12-------------1830
	 * --2015-08-14------151--------151-------------18-------------1200
	 * --2015-08-13------60---------60--------------60-------------6000
	 * --2015-08-12------151--------151-------------100------------8000
	 * --2015-08-11------151--------151-------------80-------------20000
	 * --2015-08-10------60---------60--------------60-------------30000
	 * @throws Exception
	 */
	List<CrazySalesStatistics> daily(Integer begin, Integer end) throws Exception;

	/**
	 * 获取商家统计
	 * @param pageNum 页码
	 * @param pageSize 页面大小
	 * @return
	 * ----商家名称--------活动覆盖小区数--------发布活动数--------总出价金额--------总抢购量--------总验码量
	 * ----shopName--------community------------activity---------price------------sales-----------used
	 * ----老家肉饼-------------8-------------------8-------------1600-------------1200------------690
	 * ----兰州拉面-------------3-------------------9-------------2400-------------3000------------1272
	 * ----海天游泳-------------2-------------------4-------------400--------------200-------------35
	 * ......
	 * @throws Exception
	 */
	Page<CrazySalesShopStatistics> shop(Integer pageNum, Integer pageSize) throws Exception;

	/**
	 * 获取某一个商家的具体统计
	 * @param emobId 店家的环信ID
	 * @return
	 * ----------------抢购活动名称----------------小区名称----------出价金额--------限购量--------抢购量--------验码量
	 * --------------------name-----------------communityName-------money----------count---------sales---------valid
	 * ----阿拉兰牛肉面套餐原价29，特价9.9--------名仕豪居------------600-------------200-----------134-----------67
	 * ----阿拉兰牛肉面套餐原价29，特价9.9--------棉纺公寓小区--------400-------------200-----------68------------35
	 * ----阿拉兰牛肉面套餐原价29，特价9.9--------汇邦幸福城----------200-------------200-----------31------------10
	 */
	List<Map<String, Object>> shopDetails(String emobId);

	/**
	 * 获取小区统计
	 * @param pageNum 页码
	 * @param pageSize 页面大小
	 * @return
	 * ----商家名称--------活动覆盖小区数--------发布活动数--------总出价金额--------总抢购量--------总验码量
	 * ----name-----------communityCount-------activityCount-----money------------sales-----------valid
	 * ----天华小区-------------10-------------------15-------------4300-------------1200----------5684
	 * ----狮子城---------------7--------------------10-------------3600-------------3000----------4103
	 * ----幸福城---------------14-------------------26-------------8400--------------200----------16582
	 * ......
	 * @throws Exception
	 */
	Page<CrazySalesCommunityStatistics> community(Integer pageNum, Integer pageSize) throws Exception;

	/**
	 * 获取某一个小区的具体统计
	 * @param communityId 小区id
	 * @return
	 * ----------------抢购活动名称---------------------出价金额--------限购量--------抢购量--------验码量
	 * --------------------name--------------------------money---------count---------sales---------valid
	 * --阿拉兰牛肉面套餐原价29，特价9.9-------------------600-----------200-----------134-----------67
	 * --四爷黄焖鸡套餐，原价43现20元----------------------560-----------200-----------68------------35
	 * --果然爱菠萝沙拉原价25，现仅需要10元就可以获得！-----140-----------100-----------31------------10
	 */
	List<Map<String, Object>> communityDetails(Integer communityId);
}